nxp-mcuxpresso/mcux-sdk/devices/MIMXRT1189/mcuxpresso/startup_mimxrt1189_cm33.cpp
//*****************************************************************************
// MIMXRT1189_cm33 startup code for use with MCUXpresso IDE
//
// Version : 131223
//*****************************************************************************
//
// Copyright 2016-2023 NXP
// All rights reserved.
//
// SPDX-License-Identifier: BSD-3-Clause
//*****************************************************************************

#if defined (DEBUG)
#pragma GCC push_options
#pragma GCC optimize ("Og")
#endif // (DEBUG)

#if defined (__cplusplus)
#ifdef __REDLIB__
#error Redlib does not support C++
#else
//*****************************************************************************
//
// The entry point for the C++ library startup
//
//*****************************************************************************
extern "C" {
    extern void __libc_init_array(void);
}
#endif
#endif

#define WEAK __attribute__ ((weak))
#define WEAK_AV __attribute__ ((weak, section(".after_vectors")))
#define ALIAS(f) __attribute__ ((weak, alias (#f)))

//*****************************************************************************
#if defined (__cplusplus)
extern "C" {
#endif

//*****************************************************************************
// Variable to store CRP value in. Will be placed automatically
// by the linker when "Enable Code Read Protect" selected.
// See crp.h header for more information
//*****************************************************************************
//*****************************************************************************
// Declaration of external SystemInit function
//*****************************************************************************
#if defined (__USE_CMSIS)
extern void SystemInit(void);
#endif // (__USE_CMSIS)

//*****************************************************************************
// Forward declaration of the core exception handlers.
// When the application defines a handler (with the same name), this will
// automatically take precedence over these weak definitions.
// If your application is a C++ one, then any interrupt handlers defined
// in C++ files within in your main application will need to have C linkage
// rather than C++ linkage. To do this, make sure that you are using extern "C"
// { .... } around the interrupt handler within your main application code.
//*****************************************************************************
     void ResetISR(void);
WEAK void NMI_Handler(void);
WEAK void HardFault_Handler(void);
WEAK void MemManage_Handler(void);
WEAK void BusFault_Handler(void);
WEAK void UsageFault_Handler(void);
WEAK void SVC_Handler(void);
WEAK void DebugMon_Handler(void);
WEAK void PendSV_Handler(void);
WEAK void SysTick_Handler(void);
WEAK void IntDefaultHandler(void);

//*****************************************************************************
// Forward declaration of the application IRQ handlers. When the application
// defines a handler (with the same name), this will automatically take
// precedence over weak definitions below
//*****************************************************************************
WEAK void TMR1_IRQHandler(void);
WEAK void DAP_IRQHandler(void);
WEAK void M7_CTI_TRIGGER_OUTPUT_IRQHandler(void);
WEAK void M33_CTI_TRIGGER_OUTPUT_IRQHandler(void);
WEAK void TMR5_IRQHandler(void);
WEAK void TMR6_IRQHandler(void);
WEAK void TMR7_IRQHandler(void);
WEAK void TMR8_IRQHandler(void);
WEAK void CAN1_IRQHandler(void);
WEAK void CAN1_ERROR_IRQHandler(void);
WEAK void GPIO1_0_IRQHandler(void);
WEAK void GPIO1_1_IRQHandler(void);
WEAK void I3C1_IRQHandler(void);
WEAK void LPI2C1_IRQHandler(void);
WEAK void LPI2C2_IRQHandler(void);
WEAK void LPIT1_IRQHandler(void);
WEAK void LPSPI1_IRQHandler(void);
WEAK void LPSPI2_IRQHandler(void);
WEAK void LPTMR1_IRQHandler(void);
WEAK void LPUART1_IRQHandler(void);
WEAK void LPUART2_IRQHandler(void);
WEAK void MU1_IRQHandler(void);
WEAK void MU2_IRQHandler(void);
WEAK void PWM1_FAULT_IRQHandler(void);
WEAK void PWM1_0_IRQHandler(void);
WEAK void PWM1_1_IRQHandler(void);
WEAK void PWM1_2_IRQHandler(void);
WEAK void PWM1_3_IRQHandler(void);
WEAK void EDGELOCK_TRUST_MUA_RX_FULL_IRQHandler(void);
WEAK void EDGELOCK_TRUST_MUA_TX_EMPTY_IRQHandler(void);
WEAK void EDGELOCK_APPS_CORE_MUA_RX_FULL_IRQHandler(void);
WEAK void EDGELOCK_APPS_CORE_MUA_TX_EMPTY_IRQHandler(void);
WEAK void EDGELOCK_REALTIME_CORE_MUA_RX_FULL_IRQHandler(void);
WEAK void EDGELOCK_REALTIME_CORE_MUA_TX_EMPTY_IRQHandler(void);
WEAK void EDGELOCK_SECURE_IRQHandler(void);
WEAK void EDGELOCK_NONSECURE_IRQHandler(void);
WEAK void TPM1_IRQHandler(void);
WEAK void TPM2_IRQHandler(void);
WEAK void RTWDOG1_IRQHandler(void);
WEAK void RTWDOG2_IRQHandler(void);
WEAK void TRDC_MGR_AON_IRQHandler(void);
WEAK void PDM_HWVAD_EVENT_IRQHandler(void);
WEAK void PDM_HWVAD_ERROR_IRQHandler(void);
WEAK void PDM_EVENT_IRQHandler(void);
WEAK void PDM_ERROR_IRQHandler(void);
WEAK void SAI1_IRQHandler(void);
WEAK void CM33_PS_IRQHandler(void);
WEAK void CM33_TCM_ECC_IRQHandler(void);
WEAK void CM33_TCM_ERROR_IRQHandler(void);
WEAK void CM7_TCM_ECC_IRQHandler(void);
WEAK void CM7_TCM_ERROR_IRQHandler(void);
WEAK void CAN2_IRQHandler(void);
WEAK void CAN2_ERROR_IRQHandler(void);
WEAK void FLEXIO1_IRQHandler(void);
WEAK void FLEXIO2_IRQHandler(void);
WEAK void FLEXSPI1_IRQHandler(void);
WEAK void FLEXSPI2_IRQHandler(void);
WEAK void GPIO2_0_IRQHandler(void);
WEAK void GPIO2_1_IRQHandler(void);
WEAK void GPIO3_0_IRQHandler(void);
WEAK void GPIO3_1_IRQHandler(void);
WEAK void I3C2_IRQHandler(void);
WEAK void LPI2C3_IRQHandler(void);
WEAK void LPI2C4_IRQHandler(void);
WEAK void LPIT2_IRQHandler(void);
WEAK void LPSPI3_IRQHandler(void);
WEAK void LPSPI4_IRQHandler(void);
WEAK void LPTMR2_IRQHandler(void);
WEAK void LPUART3_IRQHandler(void);
WEAK void LPUART4_IRQHandler(void);
WEAK void LPUART5_IRQHandler(void);
WEAK void LPUART6_IRQHandler(void);
WEAK void Reserved88_IRQHandler(void);
WEAK void BBNSM_IRQHandler(void);
WEAK void SYS_CTR1_IRQHandler(void);
WEAK void TPM3_IRQHandler(void);
WEAK void TPM4_IRQHandler(void);
WEAK void TPM5_IRQHandler(void);
WEAK void TPM6_IRQHandler(void);
WEAK void RTWDOG3_IRQHandler(void);
WEAK void RTWDOG4_IRQHandler(void);
WEAK void RTWDOG5_IRQHandler(void);
WEAK void TRDC_MGR_WKUP_IRQHandler(void);
WEAK void TMPSNS_INT_IRQHandler(void);
WEAK void BBSM_IRQHandler(void);
WEAK void LDO_AON_ANA_IRQHandler(void);
WEAK void USDHC1_IRQHandler(void);
WEAK void USDHC2_IRQHandler(void);
WEAK void TRDC_MGR_MEGA_IRQHandler(void);
WEAK void SFA_IRQHandler(void);
WEAK void LDO_AON_DIG_IRQHandler(void);
WEAK void MECC1_IRQHandler(void);
WEAK void MECC2_IRQHandler(void);
WEAK void ADC1_IRQHandler(void);
WEAK void DMA_ERROR_IRQHandler(void);
WEAK void DMA3_CH0_IRQHandler(void);
WEAK void DMA3_CH1_IRQHandler(void);
WEAK void DMA3_CH2_IRQHandler(void);
WEAK void DMA3_CH3_IRQHandler(void);
WEAK void DMA3_CH4_IRQHandler(void);
WEAK void DMA3_CH5_IRQHandler(void);
WEAK void DMA3_CH6_IRQHandler(void);
WEAK void DMA3_CH7_IRQHandler(void);
WEAK void DMA3_CH8_IRQHandler(void);
WEAK void DMA3_CH9_IRQHandler(void);
WEAK void DMA3_CH10_IRQHandler(void);
WEAK void DMA3_CH11_IRQHandler(void);
WEAK void DMA3_CH12_IRQHandler(void);
WEAK void DMA3_CH13_IRQHandler(void);
WEAK void DMA3_CH14_IRQHandler(void);
WEAK void DMA3_CH15_IRQHandler(void);
WEAK void DMA3_CH16_IRQHandler(void);
WEAK void DMA3_CH17_IRQHandler(void);
WEAK void DMA3_CH18_IRQHandler(void);
WEAK void DMA3_CH19_IRQHandler(void);
WEAK void DMA3_CH20_IRQHandler(void);
WEAK void DMA3_CH21_IRQHandler(void);
WEAK void DMA3_CH22_IRQHandler(void);
WEAK void DMA3_CH23_IRQHandler(void);
WEAK void DMA3_CH24_IRQHandler(void);
WEAK void DMA3_CH25_IRQHandler(void);
WEAK void DMA3_CH26_IRQHandler(void);
WEAK void DMA3_CH27_IRQHandler(void);
WEAK void DMA3_CH28_IRQHandler(void);
WEAK void DMA3_CH29_IRQHandler(void);
WEAK void DMA3_CH30_IRQHandler(void);
WEAK void DMA3_CH31_IRQHandler(void);
WEAK void DMA4_ERROR_IRQHandler(void);
WEAK void DMA4_CH0_CH1_CH32_CH33_IRQHandler(void);
WEAK void DMA4_CH2_CH3_CH34_CH35_IRQHandler(void);
WEAK void DMA4_CH4_CH5_CH36_CH37_IRQHandler(void);
WEAK void DMA4_CH6_CH7_CH38_CH39_IRQHandler(void);
WEAK void DMA4_CH8_CH9_CH40_CH41_IRQHandler(void);
WEAK void DMA4_CH10_CH11_CH42_CH43_IRQHandler(void);
WEAK void DMA4_CH12_CH13_CH44_CH45_IRQHandler(void);
WEAK void DMA4_CH14_CH15_CH46_CH47_IRQHandler(void);
WEAK void DMA4_CH16_CH17_CH48_CH49_IRQHandler(void);
WEAK void DMA4_CH18_CH19_CH50_CH51_IRQHandler(void);
WEAK void DMA4_CH20_CH21_CH52_CH53_IRQHandler(void);
WEAK void DMA4_CH22_CH23_CH54_CH55_IRQHandler(void);
WEAK void DMA4_CH24_CH25_CH56_CH57_IRQHandler(void);
WEAK void DMA4_CH26_CH27_CH58_CH59_IRQHandler(void);
WEAK void DMA4_CH28_CH29_CH60_CH61_IRQHandler(void);
WEAK void DMA4_CH30_CH31_CH62_CH63_IRQHandler(void);
WEAK void XBAR1_CH0_CH1_IRQHandler(void);
WEAK void XBAR1_CH2_CH3_IRQHandler(void);
WEAK void SINC3_CH0_CH1_CH2_CH3_IRQHandler(void);
WEAK void EWM_IRQHandler(void);
WEAK void SEMC_IRQHandler(void);
WEAK void LPIT3_IRQHandler(void);
WEAK void LPTMR3_IRQHandler(void);
WEAK void TMR4_IRQHandler(void);
WEAK void LPI2C5_IRQHandler(void);
WEAK void LPI2C6_IRQHandler(void);
WEAK void SAI4_IRQHandler(void);
WEAK void SPDIF_IRQHandler(void);
WEAK void LPUART9_IRQHandler(void);
WEAK void LPUART10_IRQHandler(void);
WEAK void LPUART11_IRQHandler(void);
WEAK void LPUART12_IRQHandler(void);
WEAK void INTG_BOOTROM_DEBUG_CTRL_IRQHandler(void);
WEAK void EDGELOCK_REQ1_IRQHandler(void);
WEAK void EDGELOCK_REQ2_IRQHandler(void);
WEAK void EDGELOCK_REQ3_IRQHandler(void);
WEAK void TMR3_IRQHandler(void);
WEAK void JTAGC_IRQHandler(void);
WEAK void M33_SYSRESET_REQ_IRQHandler(void);
WEAK void M33_LOCKUP_IRQHandler(void);
WEAK void M7_SYSRESET_REQ_IRQHandler(void);
WEAK void M7_LOCKUP_IRQHandler(void);
WEAK void PWM2_FAULT_IRQHandler(void);
WEAK void PWM2_0_IRQHandler(void);
WEAK void PWM2_1_IRQHandler(void);
WEAK void PWM2_2_IRQHandler(void);
WEAK void PWM2_3_IRQHandler(void);
WEAK void PWM3_FAULT_IRQHandler(void);
WEAK void PWM3_0_IRQHandler(void);
WEAK void PWM3_1_IRQHandler(void);
WEAK void PWM3_2_IRQHandler(void);
WEAK void PWM3_3_IRQHandler(void);
WEAK void PWM4_FAULT_IRQHandler(void);
WEAK void PWM4_0_IRQHandler(void);
WEAK void PWM4_1_IRQHandler(void);
WEAK void PWM4_2_IRQHandler(void);
WEAK void PWM4_3_IRQHandler(void);
WEAK void EQDC1_IRQHandler(void);
WEAK void EQDC2_IRQHandler(void);
WEAK void EQDC3_IRQHandler(void);
WEAK void EQDC4_IRQHandler(void);
WEAK void ADC2_IRQHandler(void);
WEAK void DCDC_IRQHandler(void);
WEAK void CAN3_IRQHandler(void);
WEAK void CAN3_ERROR_IRQHandler(void);
WEAK void DAC_IRQHandler(void);
WEAK void LPSPI5_IRQHandler(void);
WEAK void LPSPI6_IRQHandler(void);
WEAK void LPUART7_IRQHandler(void);
WEAK void LPUART8_IRQHandler(void);
WEAK void SAI2_IRQHandler(void);
WEAK void SAI3_IRQHandler(void);
WEAK void ACMP1_IRQHandler(void);
WEAK void ACMP2_IRQHandler(void);
WEAK void ACMP3_IRQHandler(void);
WEAK void ACMP4_IRQHandler(void);
WEAK void CM7_PS_IRQHandler(void);
WEAK void CM7_MCM_IRQHandler(void);
WEAK void CM33_MCM_IRQHandler(void);
WEAK void ECAT_INT_IRQHandler(void);
WEAK void SAFETY_CLK_MON_IRQHandler(void);
WEAK void GPT1_IRQHandler(void);
WEAK void GPT2_IRQHandler(void);
WEAK void KPP_IRQHandler(void);
WEAK void USBPHY1_IRQHandler(void);
WEAK void USBPHY2_IRQHandler(void);
WEAK void USB_OTG2_IRQHandler(void);
WEAK void USB_OTG1_IRQHandler(void);
WEAK void FLEXSPI_SLV_IRQHandler(void);
WEAK void NETC_IRQHandler(void);
WEAK void MSGINTR1_IRQHandler(void);
WEAK void MSGINTR2_IRQHandler(void);
WEAK void MSGINTR3_IRQHandler(void);
WEAK void MSGINTR4_IRQHandler(void);
WEAK void MSGINTR5_IRQHandler(void);
WEAK void MSGINTR6_IRQHandler(void);
WEAK void SINC1_CH0_IRQHandler(void);
WEAK void SINC1_CH1_IRQHandler(void);
WEAK void SINC1_CH2_IRQHandler(void);
WEAK void SINC1_CH3_IRQHandler(void);
WEAK void SINC2_CH0_IRQHandler(void);
WEAK void SINC2_CH1_IRQHandler(void);
WEAK void SINC2_CH2_IRQHandler(void);
WEAK void SINC2_CH3_IRQHandler(void);
WEAK void GPIO4_IRQHandler(void);
WEAK void TMR2_IRQHandler(void);
WEAK void GPIO5_IRQHandler(void);
WEAK void ASRC_IRQHandler(void);
WEAK void GPIO6_IRQHandler(void);
WEAK void DBG_TRACE_IRQHandler(void);
WEAK void ECAT_RST_OUT_IRQHandler(void);

