nxp-mcuxpresso/mcux-sdk/devices/MIMXRT1189/mcuxpresso/startup_mimxrt1189_cm33.cpp
//*****************************************************************************
// Forward declaration of the driver IRQ handlers. These are aliased
// to the IntDefaultHandler, which is a 'forever' loop. When the driver
// defines a handler (with the same name), this will automatically take
// precedence over these weak definitions
//*****************************************************************************
void TMR1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DAP_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void M7_CTI_TRIGGER_OUTPUT_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void M33_CTI_TRIGGER_OUTPUT_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void TMR5_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void TMR6_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void TMR7_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void TMR8_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void CAN1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void CAN1_ERROR_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GPIO1_0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GPIO1_1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void I3C1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPI2C1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPI2C2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPIT1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPSPI1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPSPI2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPTMR1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPUART1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPUART2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void MU1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void MU2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PWM1_FAULT_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PWM1_0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PWM1_1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PWM1_2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PWM1_3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EDGELOCK_TRUST_MUA_RX_FULL_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EDGELOCK_TRUST_MUA_TX_EMPTY_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EDGELOCK_APPS_CORE_MUA_RX_FULL_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EDGELOCK_APPS_CORE_MUA_TX_EMPTY_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EDGELOCK_REALTIME_CORE_MUA_RX_FULL_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EDGELOCK_REALTIME_CORE_MUA_TX_EMPTY_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EDGELOCK_SECURE_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EDGELOCK_NONSECURE_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void TPM1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void TPM2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void RTWDOG1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void RTWDOG2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void TRDC_MGR_AON_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PDM_HWVAD_EVENT_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PDM_HWVAD_ERROR_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PDM_EVENT_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PDM_ERROR_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SAI1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void CM33_PS_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void CM33_TCM_ECC_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void CM33_TCM_ERROR_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void CM7_TCM_ECC_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void CM7_TCM_ERROR_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void CAN2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void CAN2_ERROR_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FLEXIO1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FLEXIO2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FLEXSPI1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FLEXSPI2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GPIO2_0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GPIO2_1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GPIO3_0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GPIO3_1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void I3C2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPI2C3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPI2C4_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPIT2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPSPI3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPSPI4_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPTMR2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPUART3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPUART4_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPUART5_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPUART6_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved88_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void BBNSM_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SYS_CTR1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void TPM3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void TPM4_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void TPM5_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void TPM6_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void RTWDOG3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void RTWDOG4_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void RTWDOG5_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void TRDC_MGR_WKUP_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void TMPSNS_INT_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void BBSM_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LDO_AON_ANA_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void USDHC1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void USDHC2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void TRDC_MGR_MEGA_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SFA_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LDO_AON_DIG_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void MECC1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void MECC2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void ADC1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA_ERROR_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA3_CH0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA3_CH1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA3_CH2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA3_CH3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA3_CH4_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA3_CH5_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA3_CH6_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA3_CH7_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA3_CH8_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA3_CH9_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA3_CH10_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA3_CH11_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA3_CH12_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA3_CH13_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA3_CH14_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA3_CH15_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA3_CH16_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA3_CH17_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA3_CH18_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA3_CH19_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA3_CH20_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA3_CH21_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA3_CH22_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA3_CH23_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA3_CH24_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA3_CH25_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA3_CH26_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA3_CH27_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA3_CH28_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA3_CH29_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA3_CH30_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA3_CH31_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA4_ERROR_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA4_CH0_CH1_CH32_CH33_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA4_CH2_CH3_CH34_CH35_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA4_CH4_CH5_CH36_CH37_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA4_CH6_CH7_CH38_CH39_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA4_CH8_CH9_CH40_CH41_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA4_CH10_CH11_CH42_CH43_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA4_CH12_CH13_CH44_CH45_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA4_CH14_CH15_CH46_CH47_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA4_CH16_CH17_CH48_CH49_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA4_CH18_CH19_CH50_CH51_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA4_CH20_CH21_CH52_CH53_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA4_CH22_CH23_CH54_CH55_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA4_CH24_CH25_CH56_CH57_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA4_CH26_CH27_CH58_CH59_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA4_CH28_CH29_CH60_CH61_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA4_CH30_CH31_CH62_CH63_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void XBAR1_CH0_CH1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void XBAR1_CH2_CH3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SINC3_CH0_CH1_CH2_CH3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EWM_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SEMC_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPIT3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPTMR3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void TMR4_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPI2C5_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPI2C6_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SAI4_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SPDIF_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPUART9_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPUART10_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPUART11_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPUART12_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void INTG_BOOTROM_DEBUG_CTRL_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EDGELOCK_REQ1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EDGELOCK_REQ2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EDGELOCK_REQ3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void TMR3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void JTAGC_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void M33_SYSRESET_REQ_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void M33_LOCKUP_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void M7_SYSRESET_REQ_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void M7_LOCKUP_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PWM2_FAULT_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PWM2_0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PWM2_1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PWM2_2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PWM2_3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PWM3_FAULT_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PWM3_0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PWM3_1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PWM3_2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PWM3_3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PWM4_FAULT_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PWM4_0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PWM4_1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PWM4_2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PWM4_3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EQDC1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EQDC2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EQDC3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EQDC4_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void ADC2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DCDC_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void CAN3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void CAN3_ERROR_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DAC_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPSPI5_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPSPI6_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPUART7_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPUART8_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SAI2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SAI3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void ACMP1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void ACMP2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void ACMP3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void ACMP4_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void CM7_PS_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void CM7_MCM_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void CM33_MCM_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void ECAT_INT_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SAFETY_CLK_MON_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GPT1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GPT2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void KPP_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void USBPHY1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void USBPHY2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void USB_OTG2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void USB_OTG1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FLEXSPI_SLV_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void NETC_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void MSGINTR1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void MSGINTR2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void MSGINTR3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void MSGINTR4_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void MSGINTR5_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void MSGINTR6_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SINC1_CH0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SINC1_CH1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SINC1_CH2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SINC1_CH3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SINC2_CH0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SINC2_CH1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SINC2_CH2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SINC2_CH3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GPIO4_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void TMR2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GPIO5_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void ASRC_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GPIO6_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DBG_TRACE_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void ECAT_RST_OUT_DriverIRQHandler(void) ALIAS(IntDefaultHandler);

//*****************************************************************************
// The entry point for the application.
// __main() is the entry point for Redlib based applications
// main() is the entry point for Newlib based applications
//*****************************************************************************
#if defined (__REDLIB__)
extern void __main(void);
#endif
extern int main(void);

//*****************************************************************************
// External declaration for the pointer to the stack top from the Linker Script
//*****************************************************************************
extern void _vStackTop(void);
extern void _vStackBase(void);
//*****************************************************************************
#if defined (__cplusplus)
} // extern "C"
#endif
//*****************************************************************************
// The vector table.
// This relies on the linker script to place at correct location in memory.
//*****************************************************************************

